zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/pio/pic32cz1038ca70144.h
#define PORT_PB12D_PMC_PCK0                        (1UL << 12)
#define PIN_PB13B_PMC_PCK0                         (45L)        /**< PMC signal: PCK0 on PB13 mux B*/
#define MUX_PB13B_PMC_PCK0                         (1L)         /**< PMC signal line function value: PCK0 */
#define PORT_PB13B_PMC_PCK0                        (1UL << 13)
#define PIN_PA17B_PMC_PCK1                         (17L)        /**< PMC signal: PCK1 on PA17 mux B*/
#define MUX_PA17B_PMC_PCK1                         (1L)         /**< PMC signal line function value: PCK1 */
#define PORT_PA17B_PMC_PCK1                        (1UL << 17)
#define PIN_PA21B_PMC_PCK1                         (21L)        /**< PMC signal: PCK1 on PA21 mux B*/
#define MUX_PA21B_PMC_PCK1                         (1L)         /**< PMC signal line function value: PCK1 */
#define PORT_PA21B_PMC_PCK1                        (1UL << 21)
#define PIN_PA3C_PMC_PCK2                          (3L)         /**< PMC signal: PCK2 on PA3 mux C*/
#define MUX_PA3C_PMC_PCK2                          (2L)         /**< PMC signal line function value: PCK2 */
#define PORT_PA3C_PMC_PCK2                         (1UL << 3)
#define PIN_PA18B_PMC_PCK2                         (18L)        /**< PMC signal: PCK2 on PA18 mux B*/
#define MUX_PA18B_PMC_PCK2                         (1L)         /**< PMC signal line function value: PCK2 */
#define PORT_PA18B_PMC_PCK2                        (1UL << 18)
#define PIN_PA31B_PMC_PCK2                         (31L)        /**< PMC signal: PCK2 on PA31 mux B*/
#define MUX_PA31B_PMC_PCK2                         (1L)         /**< PMC signal line function value: PCK2 */
#define PORT_PA31B_PMC_PCK2                        (1UL << 31)
#define PIN_PB3B_PMC_PCK2                          (35L)        /**< PMC signal: PCK2 on PB3 mux B*/
#define MUX_PB3B_PMC_PCK2                          (1L)         /**< PMC signal line function value: PCK2 */
#define PORT_PB3B_PMC_PCK2                         (1UL << 3)
#define PIN_PD31C_PMC_PCK2                         (127L)       /**< PMC signal: PCK2 on PD31 mux C*/
#define MUX_PD31C_PMC_PCK2                         (2L)         /**< PMC signal line function value: PCK2 */
#define PORT_PD31C_PMC_PCK2                        (1UL << 31)
/* ========== PIO definition for PWMC0 peripheral ========== */
#define PIN_PA10B_PWMC0_PWMEXTRG0                  (10L)        /**< PWMC0 signal: PWMC0_PWMEXTRG0 on PA10 mux B*/
#define MUX_PA10B_PWMC0_PWMEXTRG0                  (1L)         /**< PWMC0 signal line function value: PWMC0_PWMEXTRG0 */
#define PORT_PA10B_PWMC0_PWMEXTRG0                 (1UL << 10)
#define PIN_PA22B_PWMC0_PWMEXTRG1                  (22L)        /**< PWMC0 signal: PWMC0_PWMEXTRG1 on PA22 mux B*/
#define MUX_PA22B_PWMC0_PWMEXTRG1                  (1L)         /**< PWMC0 signal line function value: PWMC0_PWMEXTRG1 */
#define PORT_PA22B_PWMC0_PWMEXTRG1                 (1UL << 22)
#define PIN_PA9C_PWMC0_PWMFI0                      (9L)         /**< PWMC0 signal: PWMC0_PWMFI0 on PA9 mux C*/
#define MUX_PA9C_PWMC0_PWMFI0                      (2L)         /**< PWMC0 signal line function value: PWMC0_PWMFI0 */
#define PORT_PA9C_PWMC0_PWMFI0                     (1UL << 9)
#define PIN_PD8B_PWMC0_PWMFI1                      (104L)       /**< PWMC0 signal: PWMC0_PWMFI1 on PD8 mux B*/
#define MUX_PD8B_PWMC0_PWMFI1                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMFI1 */
#define PORT_PD8B_PWMC0_PWMFI1                     (1UL << 8)
#define PIN_PD9B_PWMC0_PWMFI2                      (105L)       /**< PWMC0 signal: PWMC0_PWMFI2 on PD9 mux B*/
#define MUX_PD9B_PWMC0_PWMFI2                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMFI2 */
#define PORT_PD9B_PWMC0_PWMFI2                     (1UL << 9)
#define PIN_PA0A_PWMC0_PWMH0                       (0L)         /**< PWMC0 signal: PWMC0_PWMH0 on PA0 mux A*/
#define MUX_PA0A_PWMC0_PWMH0                       (0L)         /**< PWMC0 signal line function value: PWMC0_PWMH0 */
#define PORT_PA0A_PWMC0_PWMH0                      (1UL << 0)
#define PIN_PA11B_PWMC0_PWMH0                      (11L)        /**< PWMC0 signal: PWMC0_PWMH0 on PA11 mux B*/
#define MUX_PA11B_PWMC0_PWMH0                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH0 */
#define PORT_PA11B_PWMC0_PWMH0                     (1UL << 11)
#define PIN_PA23B_PWMC0_PWMH0                      (23L)        /**< PWMC0 signal: PWMC0_PWMH0 on PA23 mux B*/
#define MUX_PA23B_PWMC0_PWMH0                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH0 */
#define PORT_PA23B_PWMC0_PWMH0                     (1UL << 23)
#define PIN_PB0A_PWMC0_PWMH0                       (32L)        /**< PWMC0 signal: PWMC0_PWMH0 on PB0 mux A*/
#define MUX_PB0A_PWMC0_PWMH0                       (0L)         /**< PWMC0 signal line function value: PWMC0_PWMH0 */
#define PORT_PB0A_PWMC0_PWMH0                      (1UL << 0)
#define PIN_PD11B_PWMC0_PWMH0                      (107L)       /**< PWMC0 signal: PWMC0_PWMH0 on PD11 mux B*/
#define MUX_PD11B_PWMC0_PWMH0                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH0 */
#define PORT_PD11B_PWMC0_PWMH0                     (1UL << 11)
#define PIN_PD20A_PWMC0_PWMH0                      (116L)       /**< PWMC0 signal: PWMC0_PWMH0 on PD20 mux A*/
#define MUX_PD20A_PWMC0_PWMH0                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWMH0 */
#define PORT_PD20A_PWMC0_PWMH0                     (1UL << 20)
#define PIN_PA2A_PWMC0_PWMH1                       (2L)         /**< PWMC0 signal: PWMC0_PWMH1 on PA2 mux A*/
#define MUX_PA2A_PWMC0_PWMH1                       (0L)         /**< PWMC0 signal line function value: PWMC0_PWMH1 */
#define PORT_PA2A_PWMC0_PWMH1                      (1UL << 2)
#define PIN_PA12B_PWMC0_PWMH1                      (12L)        /**< PWMC0 signal: PWMC0_PWMH1 on PA12 mux B*/
#define MUX_PA12B_PWMC0_PWMH1                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH1 */
#define PORT_PA12B_PWMC0_PWMH1                     (1UL << 12)
#define PIN_PA24B_PWMC0_PWMH1                      (24L)        /**< PWMC0 signal: PWMC0_PWMH1 on PA24 mux B*/
#define MUX_PA24B_PWMC0_PWMH1                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH1 */
#define PORT_PA24B_PWMC0_PWMH1                     (1UL << 24)
#define PIN_PB1A_PWMC0_PWMH1                       (33L)        /**< PWMC0 signal: PWMC0_PWMH1 on PB1 mux A*/
#define MUX_PB1A_PWMC0_PWMH1                       (0L)         /**< PWMC0 signal line function value: PWMC0_PWMH1 */
#define PORT_PB1A_PWMC0_PWMH1                      (1UL << 1)
#define PIN_PD21A_PWMC0_PWMH1                      (117L)       /**< PWMC0 signal: PWMC0_PWMH1 on PD21 mux A*/
#define MUX_PD21A_PWMC0_PWMH1                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWMH1 */
#define PORT_PD21A_PWMC0_PWMH1                     (1UL << 21)
#define PIN_PA13B_PWMC0_PWMH2                      (13L)        /**< PWMC0 signal: PWMC0_PWMH2 on PA13 mux B*/
#define MUX_PA13B_PWMC0_PWMH2                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH2 */
#define PORT_PA13B_PWMC0_PWMH2                     (1UL << 13)
#define PIN_PA25B_PWMC0_PWMH2                      (25L)        /**< PWMC0 signal: PWMC0_PWMH2 on PA25 mux B*/
#define MUX_PA25B_PWMC0_PWMH2                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH2 */
#define PORT_PA25B_PWMC0_PWMH2                     (1UL << 25)
#define PIN_PB4B_PWMC0_PWMH2                       (36L)        /**< PWMC0 signal: PWMC0_PWMH2 on PB4 mux B*/
#define MUX_PB4B_PWMC0_PWMH2                       (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH2 */
#define PORT_PB4B_PWMC0_PWMH2                      (1UL << 4)
#define PIN_PC19B_PWMC0_PWMH2                      (83L)        /**< PWMC0 signal: PWMC0_PWMH2 on PC19 mux B*/
#define MUX_PC19B_PWMC0_PWMH2                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH2 */
#define PORT_PC19B_PWMC0_PWMH2                     (1UL << 19)
#define PIN_PD22A_PWMC0_PWMH2                      (118L)       /**< PWMC0 signal: PWMC0_PWMH2 on PD22 mux A*/
#define MUX_PD22A_PWMC0_PWMH2                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWMH2 */
#define PORT_PD22A_PWMC0_PWMH2                     (1UL << 22)
#define PIN_PA7B_PWMC0_PWMH3                       (7L)         /**< PWMC0 signal: PWMC0_PWMH3 on PA7 mux B*/
#define MUX_PA7B_PWMC0_PWMH3                       (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH3 */
#define PORT_PA7B_PWMC0_PWMH3                      (1UL << 7)
#define PIN_PA14B_PWMC0_PWMH3                      (14L)        /**< PWMC0 signal: PWMC0_PWMH3 on PA14 mux B*/
#define MUX_PA14B_PWMC0_PWMH3                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH3 */
#define PORT_PA14B_PWMC0_PWMH3                     (1UL << 14)
#define PIN_PA17C_PWMC0_PWMH3                      (17L)        /**< PWMC0 signal: PWMC0_PWMH3 on PA17 mux C*/
#define MUX_PA17C_PWMC0_PWMH3                      (2L)         /**< PWMC0 signal line function value: PWMC0_PWMH3 */
#define PORT_PA17C_PWMC0_PWMH3                     (1UL << 17)
#define PIN_PC13B_PWMC0_PWMH3                      (77L)        /**< PWMC0 signal: PWMC0_PWMH3 on PC13 mux B*/
#define MUX_PC13B_PWMC0_PWMH3                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH3 */
#define PORT_PC13B_PWMC0_PWMH3                     (1UL << 13)
#define PIN_PC21B_PWMC0_PWMH3                      (85L)        /**< PWMC0 signal: PWMC0_PWMH3 on PC21 mux B*/
#define MUX_PC21B_PWMC0_PWMH3                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH3 */
#define PORT_PC21B_PWMC0_PWMH3                     (1UL << 21)
#define PIN_PD23A_PWMC0_PWMH3                      (119L)       /**< PWMC0 signal: PWMC0_PWMH3 on PD23 mux A*/
#define MUX_PD23A_PWMC0_PWMH3                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWMH3 */
#define PORT_PD23A_PWMC0_PWMH3                     (1UL << 23)
#define PIN_PA1A_PWMC0_PWML0                       (1L)         /**< PWMC0 signal: PWMC0_PWML0 on PA1 mux A*/
#define MUX_PA1A_PWMC0_PWML0                       (0L)         /**< PWMC0 signal line function value: PWMC0_PWML0 */
#define PORT_PA1A_PWMC0_PWML0                      (1UL << 1)
#define PIN_PA19B_PWMC0_PWML0                      (19L)        /**< PWMC0 signal: PWMC0_PWML0 on PA19 mux B*/
#define MUX_PA19B_PWMC0_PWML0                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWML0 */
#define PORT_PA19B_PWMC0_PWML0                     (1UL << 19)
#define PIN_PB5B_PWMC0_PWML0                       (37L)        /**< PWMC0 signal: PWMC0_PWML0 on PB5 mux B*/
#define MUX_PB5B_PWMC0_PWML0                       (1L)         /**< PWMC0 signal line function value: PWMC0_PWML0 */
#define PORT_PB5B_PWMC0_PWML0                      (1UL << 5)
#define PIN_PC0B_PWMC0_PWML0                       (64L)        /**< PWMC0 signal: PWMC0_PWML0 on PC0 mux B*/
#define MUX_PC0B_PWMC0_PWML0                       (1L)         /**< PWMC0 signal line function value: PWMC0_PWML0 */
#define PORT_PC0B_PWMC0_PWML0                      (1UL << 0)
#define PIN_PD10B_PWMC0_PWML0                      (106L)       /**< PWMC0 signal: PWMC0_PWML0 on PD10 mux B*/
#define MUX_PD10B_PWMC0_PWML0                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWML0 */
#define PORT_PD10B_PWMC0_PWML0                     (1UL << 10)
#define PIN_PD24A_PWMC0_PWML0                      (120L)       /**< PWMC0 signal: PWMC0_PWML0 on PD24 mux A*/
#define MUX_PD24A_PWMC0_PWML0                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWML0 */
#define PORT_PD24A_PWMC0_PWML0                     (1UL << 24)
#define PIN_PA20B_PWMC0_PWML1                      (20L)        /**< PWMC0 signal: PWMC0_PWML1 on PA20 mux B*/
#define MUX_PA20B_PWMC0_PWML1                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWML1 */
#define PORT_PA20B_PWMC0_PWML1                     (1UL << 20)
#define PIN_PB12A_PWMC0_PWML1                      (44L)        /**< PWMC0 signal: PWMC0_PWML1 on PB12 mux A*/
#define MUX_PB12A_PWMC0_PWML1                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWML1 */
#define PORT_PB12A_PWMC0_PWML1                     (1UL << 12)
#define PIN_PC1B_PWMC0_PWML1                       (65L)        /**< PWMC0 signal: PWMC0_PWML1 on PC1 mux B*/
#define MUX_PC1B_PWMC0_PWML1                       (1L)         /**< PWMC0 signal line function value: PWMC0_PWML1 */
#define PORT_PC1B_PWMC0_PWML1                      (1UL << 1)
#define PIN_PC18B_PWMC0_PWML1                      (82L)        /**< PWMC0 signal: PWMC0_PWML1 on PC18 mux B*/
#define MUX_PC18B_PWMC0_PWML1                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWML1 */
#define PORT_PC18B_PWMC0_PWML1                     (1UL << 18)
#define PIN_PD25A_PWMC0_PWML1                      (121L)       /**< PWMC0 signal: PWMC0_PWML1 on PD25 mux A*/
#define MUX_PD25A_PWMC0_PWML1                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWML1 */
#define PORT_PD25A_PWMC0_PWML1                     (1UL << 25)
#define PIN_PA16C_PWMC0_PWML2                      (16L)        /**< PWMC0 signal: PWMC0_PWML2 on PA16 mux C*/
#define MUX_PA16C_PWMC0_PWML2                      (2L)         /**< PWMC0 signal line function value: PWMC0_PWML2 */
#define PORT_PA16C_PWMC0_PWML2                     (1UL << 16)
#define PIN_PA30A_PWMC0_PWML2                      (30L)        /**< PWMC0 signal: PWMC0_PWML2 on PA30 mux A*/
#define MUX_PA30A_PWMC0_PWML2                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWML2 */
#define PORT_PA30A_PWMC0_PWML2                     (1UL << 30)
#define PIN_PB13A_PWMC0_PWML2                      (45L)        /**< PWMC0 signal: PWMC0_PWML2 on PB13 mux A*/
#define MUX_PB13A_PWMC0_PWML2                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWML2 */
#define PORT_PB13A_PWMC0_PWML2                     (1UL << 13)
#define PIN_PC2B_PWMC0_PWML2                       (66L)        /**< PWMC0 signal: PWMC0_PWML2 on PC2 mux B*/
#define MUX_PC2B_PWMC0_PWML2                       (1L)         /**< PWMC0 signal line function value: PWMC0_PWML2 */
#define PORT_PC2B_PWMC0_PWML2                      (1UL << 2)
#define PIN_PC20B_PWMC0_PWML2                      (84L)        /**< PWMC0 signal: PWMC0_PWML2 on PC20 mux B*/
#define MUX_PC20B_PWMC0_PWML2                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWML2 */
#define PORT_PC20B_PWMC0_PWML2                     (1UL << 20)
#define PIN_PD26A_PWMC0_PWML2                      (122L)       /**< PWMC0 signal: PWMC0_PWML2 on PD26 mux A*/
#define MUX_PD26A_PWMC0_PWML2                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWML2 */
#define PORT_PD26A_PWMC0_PWML2                     (1UL << 26)
#define PIN_PA15C_PWMC0_PWML3                      (15L)        /**< PWMC0 signal: PWMC0_PWML3 on PA15 mux C*/
#define MUX_PA15C_PWMC0_PWML3                      (2L)         /**< PWMC0 signal line function value: PWMC0_PWML3 */
#define PORT_PA15C_PWMC0_PWML3                     (1UL << 15)
#define PIN_PC3B_PWMC0_PWML3                       (67L)        /**< PWMC0 signal: PWMC0_PWML3 on PC3 mux B*/
#define MUX_PC3B_PWMC0_PWML3                       (1L)         /**< PWMC0 signal line function value: PWMC0_PWML3 */
#define PORT_PC3B_PWMC0_PWML3                      (1UL << 3)
#define PIN_PC15B_PWMC0_PWML3                      (79L)        /**< PWMC0 signal: PWMC0_PWML3 on PC15 mux B*/
#define MUX_PC15B_PWMC0_PWML3                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWML3 */
#define PORT_PC15B_PWMC0_PWML3                     (1UL << 15)
#define PIN_PC22B_PWMC0_PWML3                      (86L)        /**< PWMC0 signal: PWMC0_PWML3 on PC22 mux B*/
#define MUX_PC22B_PWMC0_PWML3                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWML3 */
#define PORT_PC22B_PWMC0_PWML3                     (1UL << 22)
#define PIN_PD27A_PWMC0_PWML3                      (123L)       /**< PWMC0 signal: PWMC0_PWML3 on PD27 mux A*/
#define MUX_PD27A_PWMC0_PWML3                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWML3 */
#define PORT_PD27A_PWMC0_PWML3                     (1UL << 27)
/* ========== PIO definition for PWMC1 peripheral ========== */
#define PIN_PA30B_PWMC1_PWMEXTRG0                  (30L)        /**< PWMC1 signal: PWMC1_PWMEXTRG0 on PA30 mux B*/
#define MUX_PA30B_PWMC1_PWMEXTRG0                  (1L)         /**< PWMC1 signal line function value: PWMC1_PWMEXTRG0 */
#define PORT_PA30B_PWMC1_PWMEXTRG0                 (1UL << 30)
#define PIN_PA18A_PWMC1_PWMEXTRG1                  (18L)        /**< PWMC1 signal: PWMC1_PWMEXTRG1 on PA18 mux A*/
#define MUX_PA18A_PWMC1_PWMEXTRG1                  (0L)         /**< PWMC1 signal line function value: PWMC1_PWMEXTRG1 */
#define PORT_PA18A_PWMC1_PWMEXTRG1                 (1UL << 18)
#define PIN_PA21C_PWMC1_PWMFI0                     (21L)        /**< PWMC1 signal: PWMC1_PWMFI0 on PA21 mux C*/
#define MUX_PA21C_PWMC1_PWMFI0                     (2L)         /**< PWMC1 signal line function value: PWMC1_PWMFI0 */
#define PORT_PA21C_PWMC1_PWMFI0                    (1UL << 21)
#define PIN_PA26D_PWMC1_PWMFI1                     (26L)        /**< PWMC1 signal: PWMC1_PWMFI1 on PA26 mux D*/
#define MUX_PA26D_PWMC1_PWMFI1                     (3L)         /**< PWMC1 signal line function value: PWMC1_PWMFI1 */
#define PORT_PA26D_PWMC1_PWMFI1                    (1UL << 26)
#define PIN_PA28D_PWMC1_PWMFI2                     (28L)        /**< PWMC1 signal: PWMC1_PWMFI2 on PA28 mux D*/
#define MUX_PA28D_PWMC1_PWMFI2                     (3L)         /**< PWMC1 signal line function value: PWMC1_PWMFI2 */
#define PORT_PA28D_PWMC1_PWMFI2                    (1UL << 28)
#define PIN_PA12C_PWMC1_PWMH0                      (12L)        /**< PWMC1 signal: PWMC1_PWMH0 on PA12 mux C*/
#define MUX_PA12C_PWMC1_PWMH0                      (2L)         /**< PWMC1 signal line function value: PWMC1_PWMH0 */
#define PORT_PA12C_PWMC1_PWMH0                     (1UL << 12)
#define PIN_PD1B_PWMC1_PWMH0                       (97L)        /**< PWMC1 signal: PWMC1_PWMH0 on PD1 mux B*/
#define MUX_PD1B_PWMC1_PWMH0                       (1L)         /**< PWMC1 signal line function value: PWMC1_PWMH0 */
#define PORT_PD1B_PWMC1_PWMH0                      (1UL << 1)
#define PIN_PA14C_PWMC1_PWMH1                      (14L)        /**< PWMC1 signal: PWMC1_PWMH1 on PA14 mux C*/
#define MUX_PA14C_PWMC1_PWMH1                      (2L)         /**< PWMC1 signal line function value: PWMC1_PWMH1 */
#define PORT_PA14C_PWMC1_PWMH1                     (1UL << 14)
#define PIN_PD3B_PWMC1_PWMH1                       (99L)        /**< PWMC1 signal: PWMC1_PWMH1 on PD3 mux B*/
#define MUX_PD3B_PWMC1_PWMH1                       (1L)         /**< PWMC1 signal line function value: PWMC1_PWMH1 */
#define PORT_PD3B_PWMC1_PWMH1                      (1UL << 3)
#define PIN_PA31D_PWMC1_PWMH2                      (31L)        /**< PWMC1 signal: PWMC1_PWMH2 on PA31 mux D*/
#define MUX_PA31D_PWMC1_PWMH2                      (3L)         /**< PWMC1 signal line function value: PWMC1_PWMH2 */
#define PORT_PA31D_PWMC1_PWMH2                     (1UL << 31)
#define PIN_PD5B_PWMC1_PWMH2                       (101L)       /**< PWMC1 signal: PWMC1_PWMH2 on PD5 mux B*/
#define MUX_PD5B_PWMC1_PWMH2                       (1L)         /**< PWMC1 signal line function value: PWMC1_PWMH2 */
#define PORT_PD5B_PWMC1_PWMH2                      (1UL << 5)
#define PIN_PA8A_PWMC1_PWMH3                       (8L)         /**< PWMC1 signal: PWMC1_PWMH3 on PA8 mux A*/
#define MUX_PA8A_PWMC1_PWMH3                       (0L)         /**< PWMC1 signal line function value: PWMC1_PWMH3 */
#define PORT_PA8A_PWMC1_PWMH3                      (1UL << 8)
#define PIN_PD7B_PWMC1_PWMH3                       (103L)       /**< PWMC1 signal: PWMC1_PWMH3 on PD7 mux B*/
#define MUX_PD7B_PWMC1_PWMH3                       (1L)         /**< PWMC1 signal line function value: PWMC1_PWMH3 */
#define PORT_PD7B_PWMC1_PWMH3                      (1UL << 7)
#define PIN_PA11C_PWMC1_PWML0                      (11L)        /**< PWMC1 signal: PWMC1_PWML0 on PA11 mux C*/
#define MUX_PA11C_PWMC1_PWML0                      (2L)         /**< PWMC1 signal line function value: PWMC1_PWML0 */
#define PORT_PA11C_PWMC1_PWML0                     (1UL << 11)
#define PIN_PD0B_PWMC1_PWML0                       (96L)        /**< PWMC1 signal: PWMC1_PWML0 on PD0 mux B*/
#define MUX_PD0B_PWMC1_PWML0                       (1L)         /**< PWMC1 signal line function value: PWMC1_PWML0 */
#define PORT_PD0B_PWMC1_PWML0                      (1UL << 0)
#define PIN_PA13C_PWMC1_PWML1                      (13L)        /**< PWMC1 signal: PWMC1_PWML1 on PA13 mux C*/
#define MUX_PA13C_PWMC1_PWML1                      (2L)         /**< PWMC1 signal line function value: PWMC1_PWML1 */
#define PORT_PA13C_PWMC1_PWML1                     (1UL << 13)
#define PIN_PD2B_PWMC1_PWML1                       (98L)        /**< PWMC1 signal: PWMC1_PWML1 on PD2 mux B*/
#define MUX_PD2B_PWMC1_PWML1                       (1L)         /**< PWMC1 signal line function value: PWMC1_PWML1 */
#define PORT_PD2B_PWMC1_PWML1                      (1UL << 2)
#define PIN_PA23D_PWMC1_PWML2                      (23L)        /**< PWMC1 signal: PWMC1_PWML2 on PA23 mux D*/
#define MUX_PA23D_PWMC1_PWML2                      (3L)         /**< PWMC1 signal line function value: PWMC1_PWML2 */
#define PORT_PA23D_PWMC1_PWML2                     (1UL << 23)
#define PIN_PD4B_PWMC1_PWML2                       (100L)       /**< PWMC1 signal: PWMC1_PWML2 on PD4 mux B*/
#define MUX_PD4B_PWMC1_PWML2                       (1L)         /**< PWMC1 signal line function value: PWMC1_PWML2 */
#define PORT_PD4B_PWMC1_PWML2                      (1UL << 4)
#define PIN_PA5A_PWMC1_PWML3                       (5L)         /**< PWMC1 signal: PWMC1_PWML3 on PA5 mux A*/
#define MUX_PA5A_PWMC1_PWML3                       (0L)         /**< PWMC1 signal line function value: PWMC1_PWML3 */
#define PORT_PA5A_PWMC1_PWML3                      (1UL << 5)
#define PIN_PD6B_PWMC1_PWML3                       (102L)       /**< PWMC1 signal: PWMC1_PWML3 on PD6 mux B*/
#define MUX_PD6B_PWMC1_PWML3                       (1L)         /**< PWMC1 signal line function value: PWMC1_PWML3 */
#define PORT_PD6B_PWMC1_PWML3                      (1UL << 6)
/* ========== PIO definition for QSPI peripheral ========== */
#define PIN_PA11A_QSPI_QCS                         (11L)        /**< QSPI signal: QCS on PA11 mux A*/
#define MUX_PA11A_QSPI_QCS                         (0L)         /**< QSPI signal line function value: QCS */
#define PORT_PA11A_QSPI_QCS                        (1UL << 11)
#define PIN_PA13A_QSPI_QIO0                        (13L)        /**< QSPI signal: QIO0 on PA13 mux A*/
#define MUX_PA13A_QSPI_QIO0                        (0L)         /**< QSPI signal line function value: QIO0 */
#define PORT_PA13A_QSPI_QIO0                       (1UL << 13)
#define PIN_PA12A_QSPI_QIO1                        (12L)        /**< QSPI signal: QIO1 on PA12 mux A*/
#define MUX_PA12A_QSPI_QIO1                        (0L)         /**< QSPI signal line function value: QIO1 */
#define PORT_PA12A_QSPI_QIO1                       (1UL << 12)
